In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/025.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                  3                     4
0      NaN  NaN  NaN  Deal (R)  128,685  Bradbury (D)  39,240
1      NaN  NaN  NaN              76.6%                 23.4%
2   County   PR   TP                NaN                   NaN
3  CATOOSA   14   14               9401                  3369
4     DADE    9    9               2109                  1112

In [5]:
df = df[3:]

In [6]:
df.head(5)

         0   1   2      3     4
3  CATOOSA  14  14   9401  3369
4     DADE   9   9   2109  1112
5   DAWSON  10  10   4459   968
6   FANNIN  14  14   5059  2017
7  FORSYTH  28  28  27352  5462

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

         0      3     4
3  CATOOSA   9401  3369
4     DADE   2109  1112
5   DAWSON   4459   968
6   FANNIN   5059  2017
7  FORSYTH  27352  5462

In [9]:
df.columns = ['county', 'Nathan Deal', 'John D. Bradbury']

In [10]:
df.tail(5)

       county Nathan Deal John D. Bradbury
13    PICKENS        5585             1657
14      UNION        4728             1988
15     WALKER        8813             3797
16      WHITE        5136             1487
17  WHITFIELD       12280             4390

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

    county    candidate  votes
0  CATOOSA  Nathan Deal   9401
1     DADE  Nathan Deal   2109
2   DAWSON  Nathan Deal   4459
3   FANNIN  Nathan Deal   5059
4  FORSYTH  Nathan Deal  27352

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
county       30 non-null object
candidate    30 non-null object
votes        30 non-null int64
dtypes: int64(1), object(2)
memory usage: 800.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '9'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Nathan Deal', 'party'] = 'Republican'
df.loc[df['candidate'] == 'John D. Bradbury', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate         party
John D. Bradbury  Democrat       39240
Nathan Deal       Republican    128685
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party    candidate  votes
0  CATOOSA  U.S. Representative        9  Republican  Nathan Deal   9401
1     DADE  U.S. Representative        9  Republican  Nathan Deal   2109
2   DAWSON  U.S. Representative        9  Republican  Nathan Deal   4459
3   FANNIN  U.S. Representative        9  Republican  Nathan Deal   5059
4  FORSYTH  U.S. Representative        9  Republican  Nathan Deal  27352

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')